set1 = {1, 2, 3, 4, 5}
print('原集合:',set1)

# 1. add函数
# 语法: 集合名.add(新数据)
set1.add(6)
print(set1)  # {1, 2, 3, 4, 5, 6}

# ***注意***

# 一、集合具有唯一性
set1.add(5)  # 加入已有数据
print(set1)  # {1, 2, 3, 4, 5, 6}   不变

# 二、一次只能添加一个元素
# set1.add(7,8)    *报错*

# 2.update函数
# 集合名.update()  括号里放可迭代对象  eg:字符串,列表
# **提示**
# 可迭代对象是指可以通过for循环取出的数据类型

set2 = {1, 2, 3, 4, 5}
print('原集合:',set2)

# (1) 字符串
set2.update('789')
print(set2)  # {1, 2, 3, 4, 5, 6, '7', '8', '9'}

set3 = {1, 2, 3, 4, 5}
print('原集合:',set3)

# (2) 列表
set3.update([7,8,9])
print(set3)  # {1, 2, 3, 4, 5, 7, 8, 9}
